Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Escaping is needed for DB insertion.
es: Los más experimentados puede notar que los nombres de variable enviados por el navegador contienen un guión en vez de un subrayado (guión bajo), pero PHP convierte el guión en subrayado automáticamente.

source: PHP also understands arrays in the context of form variables (see the related faq).
es: PHP soporta cookies de HTTP de forma transparente tal y como están definidas en en las Netscape 's Spec.

source: For example, let 's post a form to itself and upon submission display the data:
es: Las cookies son un mecanismo para almacenar datos en el navegador y así rastrear o identificar a usuarios que vuelven.

source: More complex form variables
es: Se pueden crear cookies usando la función SetCookie().

source: In PHP 4, no such restriction applies.
es: Las cookies son parte de la cabecera HTTP, así que se debe llamar a la función SetCookie antes de que se envíe cualquier salida al navegador.

source: When submitting a form, it is possible to use an image instead of the standard submit button with a tag like:
es: Es la misma restricción que para la función header().

source: When the user clicks somewhere on the image, the accompanying form will be transmitted to the server with two additional variables, sub_x and sub_y.
es: Cualquier cookie que se reciba procedente del cliente será convertida automáticamente en una variable de PHP como con los datos en los métodos GET y POST.

source: The experienced may note that the actual variable names sent by the browser contains a period rather than an underscore, but PHP converts the period to an underscore automatically.
es: Por ejemplo:

source: PHP transparently supports HTTP cookies as defined by Netscape 's Spec.
es: SetCookie ("MyCookie[]", "Testing", time()+3600);

source: Cookies are part of the HTTP header, so the SetCookie function must be called before any output is sent to the browser.
es: Así, para una aplicación de carro de la compra se podría querer mantener un contador e ir pasándolo.

source: This is the same restriction as for the header() function.
es: P.ej.

source: Cookie data is then available in the appropriate cookie data arrays, such as $_COOKIE, $HTTP_COOKIE_VARS as well as in $_REQUEST.
es: SetCookie Example

source: If you wish to assign multiple values to a single cookie variable, you may assign it as an array.
es: $Count++; SetCookie ("Count", $Count, time()+3600); SetCookie ("Cart[$Count]", $item, time()+3600);

source: ?php setcookie( "MyCookie[foo]", "Testing 1", time()+3600); setcookie("MyCookie[bar]", "Testing 2", time()+3600);?
es: PHP hace accesibles las variables de entorno automáticamente tratándolas como variables normales.

source: That will create two seperate cookies although MyCookie will now be a single array in your script.
es: echo $HOME; / * Shows the HOME environment variable, if set. * /

source: Note that a cookie will replace a previous cookie by the same name in your browser unless the path or domain is different.
es: Dado que la información que llega vía mecanismos GET, POST y Cookie crean automáticamente variables de PHP, algunas veces es mejor leer variables del entorno explícitamente para asegurarse de que se está trabajando con la versión correcta.

source: Example 8-5.
es: La función getenv() La función getenv() se puede usar para ello.

source: ?php $count++; setcookie("count", $count, time()+3600); setcookie("Cart[$count]", $item, time()+3600);?
es: También se puede asignar un valor a una variable de entorno con la función putenv().

source: Typically, PHP does not alter the names of variables when they are passed into a script.
es: Típicamente, PHP no altera los nombres de las variables cuando se pasan a un script.

source: However, it should be noted that the dot (period, full stop) is not a valid character in a PHP variable name.
es: De todas formas, hay que notar que el punto no es un carácter válido en el nombre de una variable PHP.

source: For the reason, look at it:
es: Por esta razón, mire esto:

source: ?php $varname.ext; / * invalid variable name * /?
es: $varname.ext; / * nombre de variable no válido * /

source: For this reason, it is important to note that PHP will automatically replace any dots in incoming variable names with underscores.
es: Por esta razón, es importante hacer notar que PHP reemplazará automáticamente cualquier punto en los nombres de variables de entrada por guiones bajos (subrayados).

source: Because PHP determines the types of variables and converts them (generally) as needed, it is not always obvious what type a given variable is at any one time.
es: Dado que PHP determina los tipos de las variables y los convierte (generalmente) según necesita, no siempre resulta obvio de qué tipo es una variable dada en un momento concreto.

source: See also the chapter on Types.
es: Son gettype(), is_long(), is_double(), is_string(), is_array(), y is_object().

source: Variable variables
es: Variables variables

source: The variable name is case-sensitive.
es: En PHP las variables se representan como un signo de dólar seguido por el nombre de la variable.

source: Variable names follow the same rules as other labels in PHP.
es: El nombre de la variable es sensible a minúsculas y mayúsculas.

source: A valid variable name starts with a letter or underscore, followed by any number of letters, numbers, or underscores.
es: $var = "Bob"; $Var = "Joe"; echo "$var, $Var"; / / produce la salida "Bob, Joe"

source: As a regular expression, it would be expressed thus: '[a-zA-Z_\x7f-\xff][a-zA-Z0-9_\x7f-\xff]*'
es: En PHP3, las variables siempre se asignan por valor.

source: In PHP 3, variables are always assigned by value.
es: Esto quiere decir que, por ejemplo, después e asignar el valor de una variable a otra, los cambios que se efectúen a una de esas variables no afectará a la otra.

source: That is to say, when you assign an expression to a variable, the entire value of the original expression is copied into the destination variable.
es: Para más información sobre este tipo de asignación, vea Expresiones.

source: This means, for instance, that after assigning one variable 's value to another, changing one of those variables will have no effect on the other.
es: PHP4 ofrece otra forma de asignar valores a las variables: asignar por referencia.

source: PHP 4 offers another way to assign values to variables: assign by reference.
es: Esto significa que la nueva variable simplemente referencia (en otras palabras, "se convierte en un alias de "o "apunta a") la variable original.

source: This means that the new variable simply references (in other words, "becomes an alias for "or "points to") the original variable.
es: Los cambios a la nueva variable afectan a la original, y viceversa.

source: This also means that no copying is performed; thus, the assignment happens more quickly.
es: Esto también significa que no se produce una copia de valores; por tanto, la asignación ocurre más rápidamente.

source: To assign by reference, simply prepend an ampersand () to the beginning of the variable which is being assigned (the source variable).
es: De cualquier forma, cualquier incremento de velocidad se notará sólo en los bucles críticos cuando se asignen grandes arrays u objetos.

source: ?php $foo = 'Bob'; / / Assign the value'Bob' to $foo $bar = $foo; / / Reference $foo via $bar. $bar = "My name is $bar"; / / Alter $bar... echo $bar; echo $foo; / / $foo is altered too.?
es: Para asignar por referencia, simplemente se antepone un ampersand () al comienzo de la variable cuyo valor se está asignando (la variable fuente).

source: One important thing to note is that only named variables may be assigned by reference.
es: Por ejemplo, el siguiente trozo de código produce la salida 'Mi nombre es Bob' dos veces:

source: PHP follows Perl' s convention when dealing with arithmetic operations on character variables and not C's.
es: ?php $foo = 'Bob'; / / Asigna el valor 'Bob' a $foo $bar = $foo; / / Referencia $foo vía $bar. $bar = "Mi nombre es $bar"; / / Modifica $bar... echo $foo; / / $foo también se modifica. echo $bar;?

source: Example 8-1.
es: Algo importante a tener en cuenta es que sólo las variables con nombre pueden ser asignadas por referencia.

source: ?php $i = 'W'; for($n=0; $n 6; $n++) echo ++$i. "\n"; / * Produces the output similar to the following:
es: ?php $foo = 25; $bar = $foo; / / Esta es una asignación válida. $bar = (24 * 7); / / Inválida; referencia una expresión sin nombre. function test() {return 25;} $bar = test(); / / Inválida.?

source: Predefined variables
es: Variables predefinidas

source: PHP provides a large number of predefined variables to any script which it runs.
es: PHP proporciona una gran cantidad de variables predefinidas a cualquier script que se ejecute.

source: Many of these variables, however, cannot be fully documented as they are dependent upon which server is running, the version and setup of the server, and other factors.
es: De todas formas, muchas de esas variables no pueden estar completamente documentadas ya que dependen de sobre qué servidor se esté ejecutando, la versión y configuración de dicho servidor, y otros factores.

source: Some of these variables will not be available when PHP is run on the command line.
es: Algunas de estas variables no estarán disponibles cuando se ejecute PHP desde la línea de comandos.

source: In PHP 4.2.0 and later, the default value for the PHP directive register_globals is off.
es: Nota:

source: This is a major change in PHP.
es: Esta lista no es exhaustiva ni pretende serlo.

source: Having register_globals off affects the set of predefined variables available in the global scope.
es: Estas variables son creadas por el servidor web Apache.

source: For example, to get DOCUMENT_ROOT you' ll use $_SERVER['DOCUMENT_ROOT'] instead of $DOCUMENT_ROOT, or $_GET['id'] from the URL http: / /www.example.com / test.php?id=3 instead of $id, or $_ENV['HOME'] instead of $HOME.
es: Dicho esto, también están presentes las variables de la especificación CGI 1.1, por lo que también se deben tener en cuenta.

source: For related information on this change, read the configuration entry for register_globals, the security chapter on Using Register Globals, as well as the PHP 4.1.0 and 4.2.0 Release Announcements.
es: Qué revisión de la especificación CGI está usando el servidor; por ejemplo 'CGI / 1.1 '.

source: Using the available PHP Reserved Predefined Variables, like the superglobal arrays, is preferred.
es: Si el script se está ejecutando en un servidor virtual, este será el valor definido para dicho servidor virtual.

source: From version 4.1.0 onward, PHP provides an additional set of predefined arrays containing variables from the web server (if applicable), the environment, and user input.
es: Nombre y revisión del protocolo a través del que se solicitó la página; p.ej. 'HTTP / 1.0';

source: These new arrays are rather special in that they are automatically global--i.e., automatically available in every scope.
es: La cadena de la petición, si la hubo, mediante la que se accedió a la página.

source: For this reason, they are often known as' autoglobals' or'superglobals'. (There is no mechanism in PHP for user-defined superglobals.) The superglobals are listed below; however, for a listing of their contents and further discussion on PHP predefined variables and their natures, please see the section Reserved Predefined Variables.
es: Los contenidos de la cabecera Accept: de la petición actual, si hay alguna.

source: Also, you' ll notice how the older predefined variables ($HTTP_*_VARS) still exist.
es: Por ejemplo: 'iso-8859-1,*,utf-8'.

source: Variable variables:
es: Los contenidos de la cabecera Accept-Encoding: de la petición actual, si la hay.

source: Superglobals cannot be used as variable variables.
es: Los contenidos de la cabecera Accept-Language: de la petición actual, si hay alguna.

source: If certain variables in variables_order are not set, their appropriate PHP predefined arrays are also left empty.
es: Los contenidos de la cabecera Connection: de la petición actual, si hay alguna.

source: PHP Superglobals
es: Por ejemplo: 'Keep-Alive'.

source: Contains a reference to every variable which is currently available within the global scope of the script.
es: La dirección de la página (si la hay) desde la que el navegador saltó a la página actual.

source: The keys of this array are the names of the global variables. $GLOBALS has existed since PHP 3.
es: Los contenidos de la cabecera User_Agent: de la petición actual, si hay alguna.

source: Variables set by the web server or otherwise directly related to the execution environment of the current script.
es: Mozilla / 4.5 [en] (X11; U; Linux 2.2.9 i586).

source: Analogous to the old $HTTP_SERVER_VARS array (which is still available, but deprecated).
es: Entre otras cosas, se puede usar este valor con get_browser() para adaptar la funcionalidad de la página a las posibilidades del navegador del usuario.

source: Variables provided to the script via HTTP GET.
es: La dirección IP desde la que el usuario está viendo la página actual.

source: Analogous to the old $HTTP_GET_VARS array (which is still available, but deprecated).
es: La vía de acceso absoluta del script que se está ejecutando.

source: Variables provided to the script via HTTP POST.
es: El valor que se haya dado a la directiva SERVER_ADMIN (en Apache) en el fichero de configuración del servidor web.

source: Analogous to the old $HTTP_POST_VARS array (which is still available, but deprecated).
es: El puerto del equipo servidor que está usando el servidor web para la comunicación.

source: Variables provided to the script via HTTP cookies.
es: Para configuraciones por defecto, será '80'; al usar SSL, por ejemplo, cambiará al puerto que se haya definido como seguro para HTTP.

source: Analogous to the old $HTTP_COOKIE_VARS array (which is still available, but deprecated).
es: Una cadena que contiene la versión del servidor y el nombre del servidor virtual que es añadida a las páginas generadas por el servidor, si está característica está activa.

source: Variables provided to the script via HTTP post file uploads.
es: Contiene la vía de acceso del script actual.

source: Analogous to the old $HTTP_POST_FILES array (which is still available, but deprecated).
es: La URI que se dió para acceder a esta página; por ejemplo, '/ index.html'.

source: See POST method uploads for more information.
es: Muchas son proporcionadas por el intérprete de comandos en el que se está ejecutando PHP, y dado que a sistemas diferentes les gusta ejecutar diferentes tipos de intérpretes de comandos, es imposible hacer una lista definitiva.

source: Variables provided to the script via the environment.
es: Por favor, mire la documentación de su intérprete de comandos para ver una lista de las variables de entorno definidas.

source: Analogous to the old $HTTP_ENV_VARS array (which is still available, but deprecated).
es: Estas variables son creadas por el propio PHP.

source: Variables provided to the script via any user input mechanism, and which therefore cannot be trusted.
es: Cuando el script se ejecuta desde la línea de comandos, esto da un acceso, al estilo de C, a los parámetros pasados en línea de comandos.

source: The presence and order of variable inclusion in this array is defined according to the variables_order configuration directive.
es: Contiene el número de parámetros de la línea de comandos pasados al script (si se ejecuta desde la línea de comandos).

source: This array has no direct analogue in versions of PHP prior to 4.1.0.
es: El nombre del fichero que contiene el script que se esta ejecutando, relativo al directorio raíz de los documentos.

source: See also import_request_variables().
es: Si PHP se está ejecutando como intérprete de línea de comandos, esta variable no está disponible.

source: When running on the command line, this will not include the argv and argc entries; these are present in the $_SERVER array.
es: Un array asociativo de variables pasadas al script actual mediante el método HTTP GET.

source: Variables which are currently registered to a script 's session.
es: Sólo está disponible si --variable tracking- - ha sido activado mediante la directiva de configuración track_vars o la directiva ?php_track_vars?.

source: Analogous to the old $HTTP_SESSION_VARS array (which is still available, but deprecated).
es: Un array asociativo de variables pasadas al script actual mediante el método HTTP POST.

source: See the Session handling functions section for more information.
es: Sólo está disponible si --variable tracking- - ha sido activado mediante la directiva de configuración track_vars o la directiva ?php_track_vars?.

source: Variable scope
es: Ambito de las variables

source: For the most part all PHP variables only have a single scope.
es: El ámbito de una variable es el contexto dentro del que la variable está definida.

source: Here the $a variable will be available within the included b.inc Here the $a variable will be available within the included b.inc script.
es: Este ámbito simple también abarca los ficheros incluidos y los requeridos.

source: However, within user-defined functions a local function scope is introduced.
es: Por ejemplo:

source: Any variable used inside a function is by default limited to the local function scope.
es: $a = 1; include "b.inc";

source: ?php $a = 1; / * global scope * / function Test() {echo $a; / * reference to local scope variable * /} Test();?
es: Aquí, la variable $a dentro del script incluido b.inc.

source: This script will not produce any output because the echo statement refers to a local version of the $a variable, and it has not been assigned a value within this scope.
es: De todas formas, dentro de las funciones definidas por el usuario aparece un ámbito local a la función.

source: You may notice that this is a little bit different from the C language in that global variables in C are automatically available to functions unless specifically overridden by a local definition.
es: Cualquier variables que se use dentro de una función está, por defecto, limitada al ámbito local de la función.

source: This can cause some problems in that people may inadvertently change a global variable.
es: Por ejemplo:

source: The above script will output "3".
es: Este script no producirá salida, ya que la orden echo utiliza una versión local de la variable $a, a la que no se ha asignado ningún valor en su ámbito.

source: There is no limit to the number of global variables that can be manipulated by a function.
es: Puede que usted note que hay una pequeña diferencia con el lenguaje C, en el que las variables globales están disponibles automáticamente dentro de la función a menos que sean expresamente sobreescritas por una definición local.

source: A second way to access variables from the global scope is to use the special PHP-defined $GLOBALS array.
es: Esto puede causar algunos problemas, ya que la gente puede cambiar variables globales inadvertidamente.

source: ?php $a = 1; $b = 2; function Sum() {$GLOBALS["b"] = $GLOBALS["a"] + $GLOBALS["b"];} Sum(); echo $b;?
es: En PHP, las variables globales deben ser declaradas globales dentro de la función si van a ser utilizadas dentro de dicha función.

source: The $GLOBALS array is an associative array with the name of the global variable being the key and the contents of that variable being the value of the array element.
es: $a = 1; $b = 2; Function Sum () {global $a, $b; $b = $a + $b;} Sum (); echo $b;

source: Notice how $GLOBALS exists in any scope, this is because $GLOBALS is a superglobal.
es: El script anterior producirá la salida "3".

source: ?php function test_global() {/ / Most predefined variables aren't "super "and require / / 'global 'to be available to the functions local scope. global $HTTP_POST_VARS; print $HTTP_POST_VARS['name']; / / Superglobals are available in any scope and do / / not require'global'.
es: No hay límite al número de variables globales que se pueden manipular dentro de una función.

source: Another important feature of variable scoping is the static Another important feature of variable scoping is the static variable.
es: Un segundo método para acceder a las variables desde un ámbito global es usando el array $GLOBALS propio de PHP3.

source: A static variable exists only in a local function scope, but it does not lose its value when program execution leaves this scope.
es: El ejemplo anterior se puede reescribir así:

source: ?php function Test () {$a = 0; echo $a; $a++;}?
es: $a = 1; $b = 2; Function Sum () {$GLOBALS["b"] = $GLOBALS["a"] + $GLOBALS["b"];} Sum (); echo $b;

source: The $a + + which increments the variable serves no purpose since as soon as the function exits the $a variable disappears.
es: El array $GLOBALS es un array asociativo con el nombre de la variable global como clave y los contenidos de dicha variable como el valor del elemento del array.

source: To make a useful counting function which will not lose track of the current count, the $a variable is declared static:
es: Otra característica importante del ámbito de las variables es la variable static.

source: Now, every time the Test() function is called it will print the value of $a and increment it.
es: Una variable estática existe sólo en el ámbito local de la función, pero no pierde su valor cuando la ejecución del programa abandona este ámbito.

source: Static variables also provide one way to deal with recursive functions.
es: Consideremos el siguiente ejemplo:

source: A recursive function is one which calls itself.
es: Function Test () {$a = 0; echo $a; $a++;}

source: You must make sure you have an adequate way of terminating the recursion.
es: Esta función tiene poca utilidad ya que cada vez que es llamada asigna a $a el valor 0 y representa un "0".

source: ?php function Test() {static $count = 0; $count++; echo $count; if ($count 10) {Test ();} $count--;}?
es: La sentencia $a++, que incrementa la variable, no sirve para nada, ya que en cuanto la función termina la variable $a desaparece.

source: For example, a true global variable imported inside a function scope with the global statement actually creates a reference to the global variable.
es: Para hacer una función útil para contar, que no pierda la pista del valor actual del conteo, la variable $a debe declararse como estática:

source: This can lead to unexpected behaviour which the following example addresses:
es: Function Test () {static $a = 0; echo $a; $a++;}

source: ?php function test_global_ref() {global $obj; $obj = new stdclass;} function test_global_noref() {global $obj; $obj = new stdclass;} test_global_ref(); var_dump($obj); test_global_noref(); var_dump($obj);?
es: Ahora, cada vez que se llame a la función Test(), se representará el valor de $a y se incrementará.

source: NULL object( stdClass)(0) {}
es: Las variables estáticas también proporcionan una forma de manejar funciones recursivas.

source: References are not stored statically:
es: Una función recursiva es la que se llama a sí misma.

source: Executing this example will result in the following output:
es: Se debe tener cuidado al escribir una función recursiva, ya que puede ocurrir que se llame a sí misma indefinidamente.

source: NULL Static object:
es: Hay que asegurarse de implementar una forma adecuada de terminar la recursión.

source: NULL Static object: object( stdClass)(1) {["property"]= int(1)}
es: La siguiente función cuenta recursivamente hasta 10, usando la variable estática $count para saber cuándo parar:
